Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NumberOfCircuitFullOnSwitchPanel
You can't connect to switchboard [Panel Name] because there aren't enough space. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NumberOfCircuitFullForConnectionChange
You can't change the connection type to Breakers and connect to switchboard [Panel Name] because there aren't enough space. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnPanel
You can't connect to panel [Panel Name] because there aren't enough slots. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsForConnectionChange
You can't change the connection type to Breakers connect to panel  [Panel Name] because there aren't enough slots. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NoPanelCircuitBecomeASpare
Circuit [Circuit Name] in the model has become a spare because all connected elements have been disconnected. Click Delete if you want to remove the Spare, click OK to preserve the Spare..

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchNmbOfPolesAssignPanel
Cannot assign [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitBecomeASpare
Circuit [Circuit Name] in [Panel Name] has become a spare because all connected elements have been disconnected. Click Delete if you want to remove the Spare, click OK to preserve the Spare..